Ken-u/esphook/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32c3"

# Flash 4MB（SuperMini 板载）
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# USB CDC（esp_tinyusb；HID 走复合设备手写描述符）
CONFIG_TINYUSB_CDC_ENABLED=y

# Wi-Fi
CONFIG_ESP_WIFI_ENABLED=y

# NVS
CONFIG_NVS_ENCRYPTION=n

# FreeRTOS（单核 C3）
CONFIG_FREERTOS_UNICORE=y

# 日志
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
